//
//  StringData.swift
//  Rinne
//
//  Created by 杉崎康隆 on 2024/10/13.
//

import Foundation

struct StringData {
    static let strings: [String] = [
        "妙法蓮華経如来寿量品第十六自我得仏来所経諸劫数",
        "無量百千万億載阿僧祇常説法教化無数億衆生",
        "令入於仏道爾来無量劫為度衆生故方便現涅槃",
        "而実不滅度常住此説法我常住於此以諸神通力",
        "令顛倒衆生雖近而不見衆見我滅度広供養舎利",
        "咸皆懐恋慕而生渇仰心衆生既信伏質直意柔軟",
        "一心欲見仏不自惜身命時我及衆僧倶出霊鷲山",
        "我時語衆生常在此不滅以方便力故現有滅不滅",
        "余国有衆生恭敬信楽者我復於彼中為説無上法",
        "汝等不聞此但謂我滅度我見諸衆生没在於苦海",
        "故不為現身令其生渇仰因其心恋慕乃出為説法",
        "神通力如是於阿僧祇劫常在霊鷲山及余諸住処",
        "衆生見劫尽大火所焼時我此土安穏天人常充満",
        "園林諸堂閣種種宝荘厳宝樹多華果衆生所遊楽",
        "諸天撃天鼓常作衆妓楽雨曼陀羅華散仏及大衆",
        "我浄土不毀而衆見焼尽憂怖諸苦悩如是悉充満",
        "是諸罪衆生以悪業因縁過阿僧祇劫不聞三宝名",
        "諸有修功徳柔和質直者則皆見我身在此而説法",
        "或時為此衆説仏寿無量久乃見仏者為説仏難値",
        "我智力如是慧光照無量寿命無数劫久修業所得",
        "汝等有智者勿於此生疑当断令永尽仏語実不虚",
        "如医善方便為治狂子故実在而言死無能説虚妄",
        "我亦為世父救諸苦患者為凡夫顛倒実在而言滅",
        "以常見我故而生憍恣心放逸著五欲堕於悪道中",
        "我常知衆生行道不行道随応所可度為説種種法",
        "毎自作是念以何令衆生得入無上道速成就仏身"
    ]
}
