//
//  StringData.swift
//  Rinne
//
//  Created by 杉崎康隆 on 2024/10/13.
//

import Foundation

struct StringData {
    static let strings: [String] = [
        "妙法蓮華経如来寿量品第十六",
        "自我得仏来所経諸劫数無量百千万",
        "億載阿僧祇常説法教化無数億衆生",
        "令入於仏道爾来無量劫為度衆生故",
        "方便現涅槃而実不滅度常住此説法",
        "我常住於此以諸神通力令顛倒衆生",
        "雖近而不見衆見我滅度広供養舎利",
        "咸皆懐恋慕而生渇仰心衆生既信伏",
        "質直意柔軟一心欲見仏不自惜身命",
        "時我及衆僧倶出霊鷲山我時語衆生",
        "常在此不滅以方便力故現有滅不滅",
        "余国有衆生恭敬信楽者我復於彼中",
        "為説無上法汝等不聞此但謂我滅度",
        "我見諸衆生没在於苦海故不為現身",
        "令其生渇仰因其心恋慕乃出為説法",
        "神通力如是於阿僧祇劫常在霊鷲山",
        "及余諸住処衆生見劫尽大火所焼時",
        "我此土安穏天人常充満園林諸堂閣",
        "種種宝荘厳宝樹多華果衆生所遊楽",
        "諸天撃天鼓常作衆妓楽雨曼陀羅華",
        "散仏及大衆我浄土不毀而衆見焼尽",
        "憂怖諸苦悩如是悉充満是諸罪衆生",
        "以悪業因縁過阿僧祇劫不聞三宝名",
        "諸有修功徳柔和質直者則皆見我身",
        "在此而説法或時為此衆説仏寿無量",
        "久乃見仏者為説仏難値我智力如是",
        "慧光照無量寿命無数劫久修業所得",
        "汝等有智者勿於此生疑当断令永尽",
        "仏語実不虚如医善方便為治狂子故",
        "実在而言死無能説虚妄我亦為世父",
        "救諸苦患者為凡夫顛倒実在而言滅",
        "以常見我故而生憍恣心放逸著五欲",
        "堕於悪道中我常知衆生行道不行道",
        "随応所可度為説種種法毎自作是念",
        "以何令衆生得入無上道速成就仏身"
    ]
}
